import styles from './AboutPage.module.css'
import { TeamMemberCard } from '@/components/widgets/TeamMemberCard'

export default function AboutPage() {
  return (
    <main className={styles.page}>
      <h1 className={styles.title}>Команда разработчиков SkillSwap</h1>

      <section className={styles.team}>
        <TeamMemberCard
          name="Бисултанова Танзила"
          role="Тимлид"
          about="Магистрантка направления «Информатика и вычислительная техника». Я координирую работу команды, распределяю задачи, провожу код-ревью и слежу за дедлайнами. Моя главная цель — создать для ребят такие условия, в которых каждый может выдать свой максимум без выгорания."
          github="https://github.com/TanzBis"
          githubUsername="TanzBis"
        />
        <TeamMemberCard
          name="Александрова Мария"
          role="Помощник тимлида"
          about="Бакалавр по специальности «Компьютерный дизайн», магистратура по направлению «Управление разработкой цифровых продуктов». В проекте помогаю тимлиду, дорабатываю задачи других участников команды и занимаюсь собственными задачами. Моя главная задача — страховать тимлида, подхватывать работу там, где это необходимо."
          github="https://github.com/lksndrvvv"
          githubUsername="lksndrvvv"
        />
        <TeamMemberCard
          name="Слонихина Ангелина"
          role="Гуру архитектуры"
          about="По образованию я магистр архитектуры; много лет строила разнообразные частные, коммерческие и общественные пространства. А сейчас изучаю frontend-разработку.
Я — организационный маньяк. Мне нравится, когда у всего есть своё место, понятная структура и логика, поэтому в проекте я участвовала в выстраивании архитектуры, продумывании структуры и подготовке Notion."
          github="https://github.com/AngelinaChaika"
          githubUsername="AngelinaChaika"
        />
        <TeamMemberCard
          name="Федина Яна"
          role="Сенсей моковых данных"
          about="Бакалавр в области «Менеджмент и маркетинг». В проекте работала с версткой, типами, моками и пользовательской логикой. Из особо понравившегося: доработка компонентов загрузки аватара и изображений навыков стала для меня новым опытом, так как в курсе мы ее не проходили, и было интересно с этим разбираться."
          github="https://github.com/haaayla"
          githubUsername="haaayla"
        />
        <TeamMemberCard
          name="Новичкова Алина"
          role="Био-кодер"
          about="По основной профессии я биотехнолог. Сейчас работаю на предприятии по производству биопрепаратов для растений — занимаюсь направлением, связанным с разработкой и производством биологических продуктов для сельского хозяйства.
Окончила Химико-технологический институт. Сейчас параллельно осваиваю новое для себя направление."
          github="https://github.com/lina4ka-malina4ka"
          githubUsername="lina4ka-malina4ka"
        />
        <TeamMemberCard
          name="Храпкова Александра"
          role="Senior-помидорка"
          about="Инженер информационных систем и технологий, в данное время работаю фулстек-разработчиком. Одинаково люблю работать как с клиентской частью, так и с серверной логикой. Мне интересно разбираться в сложных системах, находить неочевидные решения и делать так, чтобы продукт работал надёжно и удобно, а код был понятным, поддерживаемым и аккуратным."
          github="https://github.com/magicwebdev"
          githubUsername="magicwebdev"
        />
        <TeamMemberCard
          name="Яровой Владимир"
          role="Фронтендозавр"
          about="Обучаюсь на 3-м курсе вуза по направлению «Разработка и сопровождение информационных систем». Параллельно работаю преподавателем в частной организации: веду занятия по веб-разработке и Python. В проекте занимался вёрсткой, стилизацией и созданием компонентов на основе мок-данных."
          github="https://github.com/VladimirIar"
          githubUsername="VladimirIar"
        />
        <TeamMemberCard
          name="Сидяков Никита"
          role="Нео"
          about="Получил высшее юридическое образование, но всю жизнь хотел стать программистом, моя мечта почти исполнилась! На моём пути было много трудностей и это мой последний этап, я знаю, что всё преодолею и моя мечта, наконец-то будет исполнена! Спасибо команде Яндекс Практикума - за то, что дали возможность, стать Frontend-разработчиком."
          github="https://github.com/AimpDoom"
          githubUsername="AimpDoom"
        />
        <TeamMemberCard
          name="Ондар Арат"
          role="LEGO-кодер"
          about="По первому образованию я специалист в области таможенного дела, а профессионально уже несколько лет работаю с промышленным оборудованием и международными B2B-проектами. Сейчас живу и работаю в Дубае, занимаюсь развитием бизнеса на рынках Ближнего Востока и параллельно осваиваю frontend-разработку."
          github="https://github.com/Phobosarat"
          githubUsername="Phobosarat"
        />
        <TeamMemberCard
          name="Будчанин Иван"
          role="Багослав"
          about="По образованию я техник-электрик, работаю автослесарем на СТО. Желание заниматься разработкой пришло ещё из детства — мой брат заинтересовал меня этой сферой, и я решил попробовать. Сейчас прохожу обучение в Яндекс Практикуме по направлению Frontend-разработчик, и в командном проекте моя основная зона ответственности — фронтенд."
          github="https://github.com/nerenti"
          githubUsername="nerenti"
        />
        <TeamMemberCard
          name="Кожевина Марта"
          role="Коммитыч"
          about="Развиваюсь как специалист в сфере разработки. Люблю работать над интересными проектами, получать новый опыт и решать нестандартные задачи. В рамках SkillSwap участвовала в создании и улучшении отдельных частей проекта, уделяя внимание качеству и удобству интерфейса."
          github="https://github.com/martakozhevina"
          githubUsername="martakozhevina"
        />
      </section>
    </main>
  )
}
